
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	//{
	//	"name": "Excel-клиент",
	//	"language": "java",
	//	"port": 48807,
	//	"description": null,
	//	"github": {
	//		"account": "alexandrkakushin",
	//		"repository": "comp-java-excelclient",
	//		"artifacts": {
	//			"main": "excelclient-jar-with-dependencies.jar",
	//			"epf": "excelclient.epf"
	//		}
	//	}
	//}	
		
	Для Каждого Компонента Из КомпонентыJava.ДоступныеКомпоненты() Цикл
		НоваяСтрока = Список.Добавить();
		НоваяСтрока.Имя                = Компонента.Name;
		НоваяСтрока.Язык               = Компонента.language;
		НоваяСтрока.Порт               = Компонента.port;
		НоваяСтрока.Описание           = Компонента.description;
		НоваяСтрока.GitHub_Аккаунт     = Компонента.github.account;
		НоваяСтрока.GitHub_Репозиторий = Компонента.github.repository;
		НоваяСтрока.ОсновнойАртефакт   = Компонента.github.artifacts.main;
		НоваяСтрока.ОбработкаАртефакт  = Компонента.github.artifacts.epf;
		
		НоваяСтрока.ПолноеОписание	   = Компонента;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Установить(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для установки необходимо выбрать компоненту'"));
		Возврат;
	КонецЕсли;
	
	ОписаниеОшибки = Неопределено;
	Результат = КомпонентыJavaВызовСервера.УстановитьКомпоненту(
		ТекущиеДанные.Имя, ТекущиеДанные.ПолноеОписание, ОписаниеОшибки);
		
	Если Результат <> Истина Тогда
		ПоказатьПредупреждение(, ОписаниеОшибки);
	Иначе
		ПоказатьОповещениеПользователя(НСтр("ru = 'Компонента установлена'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
