
Перем ПроксиКомпоненты;

///////////////////////////////////////////////////////////////////////////////
// ЗАПИСЬ ИНФОРМАЦИИ В ЛОГ

#Область ЗаписьИнформацииВЛог

// Запись информации в лог
//
// Параметры:
//  Объект			 - Строка - 
//  ТекстСообщения	 - Строка - 
//  Статус			 - СтатусСообщения, Неопределено - Статус сообщения (системное)
//
Процедура Записать(Объект, ТекстСообщения, Статус = Неопределено) Экспорт
	
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.Обычное;
	КонецЕсли;
	
	Если ПроксиКомпоненты = Неопределено Тогда
		ОписаниеОшибки = Неопределено;
		ПроксиКомпоненты = ПроксиКомпоненты(ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли;
	
	Если Не InMemory Тогда
		Соединение = ПроксиКомпоненты.ФабрикаXDTO.Создать("http://info.ak.ru/", "sqliteConnection");
		Соединение.fileName = ИмяФайла;
		
		ПроксиКомпоненты.logSqlite(Соединение, Объект, ТекстСообщения, Строка(Статус));
	КонецЕсли;

КонецПроцедуры

Процедура БезСтатуса(Объект, ТекстСообщения) Экспорт
	
	Записать(Объект, ТекстСообщения, СтатусСообщения.БезСтатуса);
	
КонецПроцедуры

Процедура Важное(Объект, ТекстСообщения) Экспорт
	
	Записать(Объект, ТекстСообщения, СтатусСообщения.Важное);	
	
КонецПроцедуры

Процедура Внимание(Объект, ТекстСообщения) Экспорт
	
	Записать(Объект, ТекстСообщения, СтатусСообщения.Внимание);
	
КонецПроцедуры

Процедура Обычное(Объект, ТекстСообщения) Экспорт
	
	Записать(Объект, ТекстСообщения, СтатусСообщения.Обычное);
	
КонецПроцедуры

Процедура ОченьВажное(Объект, ТекстСообщения) Экспорт
	
	Записать(Объект, ТекстСообщения, СтатусСообщения.ОченьВажное);	
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать() Экспорт
	
	Если ПроксиКомпоненты = Неопределено Тогда
		ОписаниеОшибки = Неопределено;
		ПроксиКомпоненты = ПроксиКомпоненты(ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПроксиКомпоненты(ОписаниеОшибки = Неопределено)
	
	Прокси = КомпонентыJavaПовтИсп.ПроксиКомпоненты(
		Справочники.КомпонентыJava.logger, ОписаниеОшибки);
		
	Возврат Прокси;
	
КонецФункции

#КонецОбласти