
///////////////////////////////////////////////////////////////////////////////
// РАБОТА С JAR-ФАЙЛАМИ

#Область РаботаCJARФайлом

Функция ЗапуститьКомпоненту(Компонента, ОписаниеОшибки = Неопределено) Экспорт
	
	Возврат КомпонентыJava.ЗапуститьКомпоненту(Компонента, ОписаниеОшибки);
			
КонецФункции

Функция ОстановитьКомпоненту(Компонента) Экспорт
	
	Возврат КомпонентыJava.ОстановитьКомпоненту(Компонента);	
	
КонецФункции
	
#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// КОМПОНЕНТЫ (GITHUB)

#Область Компоненты

Функция УстановитьКомпоненту(Детали, ОписаниеОшибки = Неопределено) Экспорт
	
	Возврат КомпонентыJava.УстановитьКомпоненту(Детали, ОписаниеОшибки);
	
КонецФункции

Функция ПерейтиНаВерсию(Компонента, Номер) Экспорт
	
	Возврат КомпонентыJava.ПерейтиНаВерсию(Компонента, Номер);	
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// JRE

#Область ВиртуальныеМашины

Функция ДоступныеJRE() Экспорт
	
	Возврат КомпонентыJava.ДоступныеJRE();
	
КонецФункции

Функция ПолучитьJAVA_HOME() Экспорт
	
	Возврат КомпонентыJava.ПолучитьJAVA_HOME();
	
КонецФункции

Процедура УстановитьJAVA_HOME(Значение) Экспорт
	
	КомпонентыJava.УстановитьJAVA_HOME(Значение);
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// API (Info)

#Область API_Info

Функция КомпонентаДоступна(Компонента) Экспорт

	Возврат КомпонентыJava.КомпонентаДоступна(Компонента);
	
КонецФункции

Функция ВерсияКомпоненты(Компонента, ОписаниеОшибки = Неопределено) Экспорт
	
	Возврат КомпонентыJava.ВерсияКомпоненты(Компонента, ОписаниеОшибки);
	
КонецФункции

Функция ИсторияИзмененийКомпоненты(Компонента, ОписаниеОшибки = Неопределено) Экспорт
	
	Возврат КомпонентыJava.ИсторияИзмененийКомпоненты(Компонента, ОписаниеОшибки);	
	
КонецФункции

#КонецОбласти
