
///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФукнции

// Возвращает порт компоненты по умолчанию
// 
// Возвращаемое значение:
//  Число - Порт компоненты
//
Функция ПортКомпонентыПоУмолчанию(Компонента) Экспорт
	
	Результат = 0;
	
	Если Компонента = ПредопределенноеЗначение("Справочник.КомпонентыJava.jmsclient") Тогда
		Результат = 48732;
		
	ИначеЕсли Компонента = ПредопределенноеЗначение("Справочник.КомпонентыJava.emailvalidator") Тогда
		Результат = 48800;
		
	ИначеЕсли Компонента = ПредопределенноеЗначение("Справочник.КомпонентыJava.importtable") Тогда
		Результат = 48801;
		
	ИначеЕсли Компонента = ПредопределенноеЗначение("Справочник.КомпонентыJava.sftpclient") Тогда
		Результат = 48802;
		
	ИначеЕсли Компонента = ПредопределенноеЗначение("Справочник.КомпонентыJava.regex") Тогда
		Результат = 48803;
		
	ИначеЕсли Компонента = ПредопределенноеЗначение("Справочник.КомпонентыJava.logger") Тогда
		Результат = 48804;
		
	ИначеЕсли Компонента = ПредопределенноеЗначение("Справочник.КомпонентыJava.sshclient") Тогда
		Результат = 48805;
		
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

