
Перем ПроксиКомпоненты;

///////////////////////////////////////////////////////////////////////////////
// УПРАВЛЕНИЕ СЕССИЕЙ

#Область УправлениеСессией

Функция ОткрытьСессию() Экспорт
	
	ПроксиКомпоненты = ПроксиКомпоненты();
	
	Соединение = ПроксиКомпоненты.ФабрикаXDTO.Создать("http://ldap.ak.ru/", "connection");
	Соединение.host = Хост;
	Соединение.port = Порт;
	Соединение.login = Пользователь;
	Соединение.password = Пароль;
	Соединение.domain = Домен;
		
	uuid = ПроксиКомпоненты.connect(Соединение, ВидLDAP);
	
КонецФункции

Функция ЗакрытьСессию() Экспорт
	
	ПроксиКомпоненты().disconnect(uuid);		
	uuid = Неопределено;
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ПРИКЛАДНЫЕ МЕТОДЫ

#Область ПрикладныеМетоды

Функция НайтиВсе(Домен) Экспорт
	
	Возврат ПроксиКомпоненты().searchAll(uuid, Домен);
		
КонецФункции

Функция ПоискПоФильтру(Домен, Фильтр) Экспорт
	
	Возврат ПроксиКомпоненты().searchByFilter(uuid, Домен, Фильтр);
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

Функция ПроксиКомпоненты()
	
	ОписаниеОшибки = Неопределено;
	Если ПроксиКомпоненты = Неопределено Тогда
		ПроксиКомпоненты = КомпонентыJavaПовтИсп.ПроксиКомпоненты(
			Справочники.КомпонентыJava.ldapclient, ОписаниеОшибки);
	КонецЕсли;
		
	Если ПроксиКомпоненты = Неопределено Тогда
		Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			ОписаниеОшибки = НСтр("ru = 'Java-компонента <LDAP-клиент> не найдена'");
		КонецЕсли;
		
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
			
	Возврат ПроксиКомпоненты;
	
КонецФункции

#КонецОбласти