
///////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ПОДКЛЮЧЕНИЯ

#Область ПараметрыПодключения

Функция Подключение_ОбщиеПараметры()
	
	Параметры = Новый Структура("СУБД");
	
	Возврат Параметры;
	
КонецФункции

Функция Подключение_PostgreSQL(Хост = Неопределено, 
	Порт = Неопределено, Логин = Неопределено, Пароль, БД = Неопределено,
	SSL = Ложь) Экспорт
	
	Параметры = Подключение_ОбщиеПараметры();
	Параметры.СУБД = СУБД_PostgreSQL();
	Параметры.Вставить("Хост", Хост);
	Параметры.Вставить("Порт", Порт);
	Параметры.Вставить("Логин", Логин);
	Параметры.Вставить("Пароль", Пароль);
	Параметры.Вставить("БД", БД);
	Параметры.Вставить("SSL", SSL);
			
	Возврат Параметры;
	
КонецФункции

Функция Подключение_SQLite(Файл = Неопределено) Экспорт
	
	Параметры = Подключение_ОбщиеПараметры();
	Параметры.Вставить("Файл", Файл);
	
	Возврат Параметры;
	
КонецФункции

// Формирование строки подключения на основе параметров
//
// Параметры:
//  Подключение - Структура - см. Обработки.SQLОбъект.Подключение_*
// 
// Возвращаемое значение:
//  Строка - Строка подключения JDBC
//
Функция СтрокаПодключения(Подключение) Экспорт
	
	Результат = "";
		
	Если Подключение.СУБД = СУБД_PostgreSQL() Тогда
		// jdbc:postgresql://localhost/test?user=fred&password=secret&ssl=true		
		Результат = Результат 
			+ "postgresql://" + Подключение.Хост + ":" + Формат(Подключение.Порт, "ЧГ=0") + "/" + Подключение.БД
		 	+ "?user=" + Подключение.Логин
			+ "&password=" + Подключение.Пароль
			+ ?(Подключение.SSL, "&ssl=true", "");				
			
	ИначеЕсли Подключение.СУБД = СУБД_SQLite() Тогда
		Результат = Результат
			+ "sqlite:"
			+ Подключение.Файл;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Результат = "jdbc:" + Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// КОНСТАНТЫ

#Область ФункцииКонстанты

Функция СУБД_PostgreSQL() Экспорт
	
	Возврат "postgresql";
	
КонецФункции

Функция СУБД_SQLite() Экспорт
	
	Возврат "sqlite";
	
КонецФункции

// todo

Функция СУБД_MySQL() Экспорт
	
	Возврат "mysql";	
	
КонецФункции

Функция СУБД_SQLServer() Экспорт
	
	Возврат "sqlserver";
	
КонецФункции

Функция СУБД_Oracle() Экспорт
	
	Возврат "oracle";
	
КонецФункции

Функция СУБД_MSAccess() Экспорт
	
	Возврат "msaccess";
	
КонецФункции

#КонецОбласти

