
// Проверка адреса электронной почты
//
// Параметры:
//  АдресЭП	 - Строка - Адрес
// 
// Возвращаемое значение:
//  Булево - 
//
Функция ЭтоВалидный(АдресЭП, ДоменВторогоУровня = Истина, ОписаниеОшибки = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Прокси = КомпонентыJavaПовтИсп.ПроксиКомпоненты(
		ПредопределенноеЗначение("Справочник.КомпонентыJava.emailvalidator"), ОписаниеОшибки);
	Если Прокси <> Неопределено Тогда
		Результат = Прокси.isValid(АдресЭП, ДоменВторогоУровня);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции