
Перем ПроксиКомпоненты;


///////////////////////////////////////////////////////////////////////////////
// ОСНОВНАЯ ФУНКЦИОНАЛЬНОСТЬ

#Область ОсновнаяФункциональность

// Проверка адреса электронной почты
//
// Параметры:
//  АдресЭП	 - Строка - Адрес
// 
// Возвращаемое значение:
//  Булево - 
//
Функция ЭтоВалидный(АдресЭП, ДоменВторогоУровня = Истина, ОписаниеОшибки = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Попытка
		Прокси = ПроксиКомпоненты(ОписаниеОшибки);
		Если Прокси <> Неопределено Тогда
			Результат = Прокси.isValid(АдресЭП, ДоменВторогоУровня);
		КонецЕсли;
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

Функция ПроксиКомпоненты(ОписаниеОшибки = Неопределено)
	
	Если ПроксиКомпоненты = Неопределено Тогда
		ПроксиКомпоненты = КомпонентыJavaПовтИсп.ПроксиКомпоненты(
			ПредопределенноеЗначение("Справочник.КомпонентыJava.emailvalidator"), ОписаниеОшибки);
	КонецЕсли;
	
	Возврат ПроксиКомпоненты;
	
КонецФункции

#КонецОбласти