
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

#Область ОбработчикиСобытийОбъекта

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИсторияИзмененийПараметр = Неопределено;
	Если Параметры.Свойство("ИсторияИзменений", ИсторияИзмененийПараметр) Тогда
		Для Каждого Запись Из ИсторияИзмененийПараметр Цикл
			ЗаполнитьЗначенияСвойств(ИсторияИзменений.Добавить(), Запись);
		КонецЦикла;
	Иначе
		Сообщить(НСтр("ru = 'Отсутствует история изменений.'"));
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти